run/FlintPhaseChange/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0.0 0.0 0.0)
    (1.5 0.0 0.0)
    (1.5 0.5 0.0)
    (0.0 0.5 0.0)
    (0.0 0.0 0.1)
    (1.5 0.0 0.1)
    (1.5 0.5 0.1)
    (0.0 0.5 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (140 62 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
            (2 6 7 3)
        );
    }
    left
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
