run/FlintPhaseChange/constant/location
ITEM: TIMESTEP
750000
ITEM: NUMBER OF ATOMS
0
ITEM: BOX BOUNDS mm mm mm
-1e-06 0.010001
-1.5e-06 0.0150015
-1e-05 0.10001
ITEM: ATOMS v_x1 v_y1 v_z1 v_rad1 