run/FlintPhaseChange/constant/timeVsLaserPosition
(
    (0         (50e-6 -200e-6 40e-6))
    (70e-6     (50e-6 -200e-6 110e-6))
    (100e-6    (50e-6 -200e-6 110e-6))
)