run/FlintPhaseChange/constant/timeVsLaserPower
(
    (0                0)
    (1e-8             0)
    (70e-6            0)
    (70.1e-6          0)
    (100e-6           0)
)