run/FlintPhaseChange/0.orig/Laser_boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Laser_boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type fixedValue;
        value uniform -1.0;
    }
    right
    {
        type fixedValue;
        value uniform -1.0;
    }
    top
    {
        type fixedValue;
        value uniform 1.0;
    }
    bottom
    {
        type fixedValue;
        value uniform -1.0;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
